Autodesk.Revit.DB.FailureMessage.#ctor(Autodesk.Revit.DB.FailureDefinitionId)
Creates a new FailureMessage related to a given FailureDefinition.
id:
Id of FailureDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
id is invalid or does not have corresponding failure definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Since:
2011